<!-- terraform-plan-github-runners -->
### Terraform Plan: `github-runners` ✅

<details>
<summary>Show plan output</summary>

```
random_password.webhook_secret: Refreshing state... [id=none]
module.github_runner.random_string.random: Refreshing state... [id=bkxacftef2lfudgwh3khloh7]
aws_ssm_parameter.cancel_runner_github_app_key[0]: Refreshing state... [id=/reinhardt-ci/cancel-runner/github-app-key]
module.github_runner.module.ssm.aws_ssm_parameter.github_app_webhook_secret[0]: Refreshing state... [id=/github-action-runners/reinhardt-ci/app/github_app_webhook_secret]
aws_iam_role_policy.scale_up_ssm_get_parameter: Refreshing state... [id=reinhardt-ci-scale-up-lambda-72725e70:ssm-get-parameter-ami-resolve]
data.aws_ami.ubuntu_arm64_latest: Reading...
data.aws_vpc.default: Reading...
module.github_runner.module.webhook.module.eventbridge[0].data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
aws_sns_topic.budget_alert: Refreshing state... [id=arn:aws:sns:us-east-1:819171434490:reinhardt-ci-budget-alert]
aws_ssm_parameter.cancel_runner_github_app_id[0]: Refreshing state... [id=/reinhardt-ci/cancel-runner/github-app-id]
module.github_runner.module.webhook.aws_apigatewayv2_api.webhook: Refreshing state... [id=51egg45i02]
module.github_runner.module.webhook.module.eventbridge[0].data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.github_runner.data.aws_iam_policy_document.deny_unsecure_transport: Reading...
module.github_runner.data.aws_iam_policy_document.deny_unsecure_transport: Read complete after 0s [id=4070628872]
module.github_runner.module.ssm.aws_ssm_parameter.github_app_id[0]: Refreshing state... [id=/github-action-runners/reinhardt-ci/app/github_app_id]
aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::819171434490:oidc-provider/token.actions.githubusercontent.com]
module.github_runner.aws_sqs_queue.queued_builds: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-queued-builds]
aws_iam_role.cancel_runner[0]: Refreshing state... [id=reinhardt-ci-cancel-runner]
module.github_runner.module.ssm.aws_ssm_parameter.github_app_key_base64[0]: Refreshing state... [id=/github-action-runners/reinhardt-ci/app/github_app_key_base64]
aws_ssm_parameter.cancel_runner_github_app_installation_id[0]: Refreshing state... [id=/reinhardt-ci/cancel-runner/github-app-installation-id]
github_actions_secret.tf_plan_aws_access_key_id: Refreshing state... [id=reinhardt-web:TF_AWS_ACCESS_KEY_ID]
github_actions_secret.tf_plan_github_app_installation_id: Refreshing state... [id=reinhardt-web:TF_GITHUB_APP_INSTALLATION_ID]
github_actions_secret.tf_plan_github_app_id: Refreshing state... [id=reinhardt-web:TF_GITHUB_APP_ID]
github_actions_secret.tf_plan_github_owner: Refreshing state... [id=reinhardt-web:TF_GITHUB_OWNER]
github_actions_secret.tf_plan_budget_alert_email: Refreshing state... [id=reinhardt-web:TF_BUDGET_ALERT_EMAIL]
data.aws_ami.ubuntu_arm64_latest: Read complete after 0s [id=ami-028f4acf86df833a8]
github_actions_secret.tf_plan_account_email: Refreshing state... [id=reinhardt-web:TF_ACCOUNT_EMAIL]
github_actions_secret.tf_plan_aws_account_id: Refreshing state... [id=reinhardt-web:TF_AWS_ACCOUNT_ID]
github_actions_secret.tf_plan_aws_secret_access_key: Refreshing state... [id=reinhardt-web:TF_AWS_SECRET_ACCESS_KEY]
github_actions_secret.tf_plan_state_bucket: Refreshing state... [id=reinhardt-web:TF_STATE_BUCKET]
github_actions_secret.tf_plan_aws_region: Refreshing state... [id=reinhardt-web:TF_AWS_REGION]
github_actions_secret.tf_plan_github_app_key_base64: Refreshing state... [id=reinhardt-web:TF_GITHUB_APP_KEY_BASE64]
github_actions_variable.self_hosted_enabled: Refreshing state... [id=reinhardt-web:SELF_HOSTED_ENABLED]
aws_budgets_budget.ci_monthly: Refreshing state... [id=819171434490:reinhardt-ci-monthly-budget]
aws_sns_topic_subscription.budget_alert_email: Refreshing state... [id=arn:aws:sns:us-east-1:819171434490:reinhardt-ci-budget-alert:f3873c02-a2f5-47ba-a1f7-bb2262537c5e]
aws_iam_role.github_actions_ami_builder: Refreshing state... [id=reinhardt-ci-gha-ami-builder]
data.aws_vpc.default: Read complete after 1s [id=vpc-067fb4e4888f67564]
module.github_runner.module.webhook.aws_apigatewayv2_stage.webhook: Refreshing state... [id=$default]
module.github_runner.aws_sqs_queue_policy.build_queue_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-queued-builds]
aws_ssm_parameter.runner_ami_id: Refreshing state... [id=/reinhardt-ci/runner-ami-id]
aws_iam_role_policy.cancel_runner_ssm_read[0]: Refreshing state... [id=reinhardt-ci-cancel-runner:ssm-read-github-app-credentials]
aws_iam_instance_profile.cancel_runner[0]: Refreshing state... [id=reinhardt-ci-cancel-runner]
aws_iam_role_policy_attachment.cancel_runner_ssm_managed[0]: Refreshing state... [id=reinhardt-ci-cancel-runner-20260314120623464500000001]
data.aws_subnets.default: Reading...
aws_security_group.cancel_runner[0]: Refreshing state... [id=sg-0be82eb70892cbeb1]
github_actions_secret.aws_role_arn: Refreshing state... [id=reinhardt-web:AWS_ROLE_ARN]
aws_iam_role_policy.ami_builder_ec2: Refreshing state... [id=reinhardt-ci-gha-ami-builder:packer-ec2-ami-build]
aws_iam_role_policy.ami_builder_ssm: Refreshing state... [id=reinhardt-ci-gha-ami-builder:ssm-put-parameter-ami]
module.github_runner.module.runners["ci"].data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.github_runner.module.runners["ci"].data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.github_runner.module.runners["release"].data.aws_caller_identity.current: Reading...
module.github_runner.module.runners["ci"].data.aws_caller_identity.current: Reading...
module.github_runner.module.runners["release"].data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.github_runner.module.runners["release"].data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.github_runner.module.runners["release"].data.aws_caller_identity.current: Read complete after 0s [id=819171434490]
module.github_runner.module.runners.aws_cloudwatch_event_rule.scale_down: Refreshing state... [id=reinhardt-ci-scale-down-rule]
module.github_runner.module.runner_binaries["linux_arm64"].data.aws_caller_identity.current: Reading...
data.aws_subnets.default: Read complete after 0s [id=us-east-1]
module.github_runner.module.runners["ci"].data.aws_caller_identity.current: Read complete after 0s [id=819171434490]
module.github_runner.module.runners.aws_ssm_parameter.runner_config_run_as: Refreshing state... [id=/github-action-runners/reinhardt-ci/runners/config/run_as]
module.github_runner.module.runners.aws_iam_role.ssm_housekeeper: Refreshing state... [id=reinhardt-ci-ssm-hk-lambda-ee965098]
module.github_runner.module.runner_binaries["linux_arm64"].data.aws_caller_identity.current: Read complete after 0s [id=819171434490]
module.github_runner.module.runners.aws_iam_role.scale_up: Refreshing state... [id=reinhardt-ci-scale-up-lambda-72725e70]
module.github_runner.module.runners.aws_iam_role.scale_down: Refreshing state... [id=reinhardt-ci-scale-down-lambda-56d130b4]
module.github_runner.module.runners.aws_ssm_parameter.token_path: Refreshing state... [id=/github-action-runners/reinhardt-ci/runners/config/token_path]
module.github_runner.module.runners.aws_ssm_parameter.runner_agent_mode: Refreshing state... [id=/github-action-runners/reinhardt-ci/runners/config/agent_mode]
module.github_runner.module.runners.aws_ssm_parameter.jit_config_enabled: Refreshing state... [id=/github-action-runners/reinhardt-ci/runners/config/enable_jit_config]
module.github_runner.module.runners.aws_ssm_parameter.disable_default_labels: Refreshing state... [id=/github-action-runners/reinhardt-ci/runners/config/disable_default_labels]
module.github_runner.module.runners.aws_ssm_parameter.runner_enable_cloudwatch: Refreshing state... [id=/github-action-runners/reinhardt-ci/runners/config/enable_cloudwatch]
module.github_runner.module.runners.aws_iam_role.runner: Refreshing state... [id=reinhardt-ci-runner-9298d1bf]
module.github_runner.module.runners.aws_cloudwatch_event_rule.ssm_housekeeper: Refreshing state... [id=reinhardt-ci-ssm-housekeeper]
module.github_runner.module.runners.aws_security_group.runner_sg[0]: Refreshing state... [id=sg-062a3e762531e49dd]
module.github_runner.module.runner_binaries["linux_arm64"].data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.github_runner.module.runner_binaries["linux_arm64"].data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
aws_instance.cancel_runner[0]: Refreshing state... [id=i-024167da93576b039]
module.github_runner.module.runners.aws_lambda_function.ssm_housekeeper: Refreshing state... [id=reinhardt-ci-ssm-housekeeper]
module.github_runner.module.runners.aws_iam_role_policy.ssm_housekeeper: Refreshing state... [id=reinhardt-ci-ssm-hk-lambda-ee965098:ssm-policy]
module.github_runner.module.runners["release"].data.aws_ami.runner: Reading...
module.github_runner.module.runners["ci"].data.aws_ami.runner: Reading...
module.github_runner.module.runners["release"].module.job_retry[0].data.aws_iam_policy_document.deny_unsecure_transport: Reading...
module.github_runner.module.runners["release"].module.job_retry[0].data.aws_iam_policy_document.deny_unsecure_transport: Read complete after 0s [id=4070628872]
module.github_runner.module.runners["ci"].module.job_retry[0].data.aws_iam_policy_document.deny_unsecure_transport: Reading...
module.github_runner.module.runners["ci"].module.job_retry[0].data.aws_iam_policy_document.deny_unsecure_transport: Read complete after 0s [id=4070628872]
module.github_runner.module.runner_binaries[0].aws_cloudwatch_event_rule.syncer: Refreshing state... [id=reinhardt-ci-syncer-rule]
module.github_runner.module.runner_binaries[0].aws_s3_bucket.action_dist: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.runner_binaries[0].aws_iam_role.syncer_lambda: Refreshing state... [id=reinhardt-ci-syncer-lambda-05106e03]
module.github_runner.module.runners.aws_iam_role_policy.scale_down: Refreshing state... [id=reinhardt-ci-scale-down-lambda-56d130b4:scale-down-policy]
module.github_runner.module.runners.aws_lambda_function.scale_down: Refreshing state... [id=reinhardt-ci-scale-down]
module.github_runner.module.runners.aws_ssm_parameter.cloudwatch_agent_config_runner[0]: Refreshing state... [id=/github-action-runners/reinhardt-ci/runners/config/cloudwatch_agent_config_runner]
module.github_runner.module.runners.aws_iam_role_policy.service_linked_role[0]: Refreshing state... [id=reinhardt-ci-scale-up-lambda-72725e70:service_linked_role]
module.github_runner.module.runners.aws_cloudwatch_log_group.gh_runners[2]: Refreshing state... [id=/github-self-hosted-runners/reinhardt-ci/runner]
module.github_runner.module.runners.aws_cloudwatch_log_group.gh_runners[0]: Refreshing state... [id=/github-self-hosted-runners/reinhardt-ci/messages]
module.github_runner.module.runners.aws_cloudwatch_log_group.gh_runners[3]: Refreshing state... [id=/github-self-hosted-runners/reinhardt-ci/runner-startup]
module.github_runner.module.runners.aws_cloudwatch_log_group.gh_runners[1]: Refreshing state... [id=/github-self-hosted-runners/reinhardt-ci/user_data]
module.github_runner.module.webhook.aws_ssm_parameter.runner_matcher_config[0]: Refreshing state... [id=/github-action-runners/reinhardt-ci/webhook/runner-matcher-config]
module.github_runner.module.runners["release"].data.aws_ami.runner: Read complete after 1s [id=ami-04aa82396fe417f2f]
module.github_runner.module.runners.aws_iam_role_policy.ssm_parameters: Refreshing state... [id=reinhardt-ci-runner-9298d1bf:runner-ssm-parameters]
module.github_runner.module.runners["ci"].data.aws_ami.runner: Read complete after 1s [id=ami-04aa82396fe417f2f]
module.github_runner.module.runners.aws_iam_role_policy.create_tag: Refreshing state... [id=reinhardt-ci-runner-9298d1bf:runner-create-tags]
module.github_runner.module.runners.aws_iam_instance_profile.runner: Refreshing state... [id=reinhardt-ci-runner-profile]
module.github_runner.module.runners.aws_iam_role_policy.ec2: Refreshing state... [id=reinhardt-ci-runner-9298d1bf:ec2]
module.github_runner.module.runners.aws_iam_role_policy.runner_session_manager_aws_managed[0]: Refreshing state... [id=reinhardt-ci-runner-9298d1bf:runner-ssm-session]
module.github_runner.module.runners.aws_iam_role_policy.describe_tags: Refreshing state... [id=reinhardt-ci-runner-9298d1bf:runner-describe-tags]
module.github_runner.module.runners.aws_iam_role_policy.cloudwatch[0]: Refreshing state... [id=reinhardt-ci-runner-9298d1bf:CloudWatchLogginAndMetrics]
module.github_runner.module.runners.aws_cloudwatch_log_group.ssm_housekeeper: Refreshing state... [id=/aws/lambda/reinhardt-ci-ssm-housekeeper]
module.github_runner.module.runners.aws_cloudwatch_event_target.ssm_housekeeper: Refreshing state... [id=reinhardt-ci-ssm-housekeeper-terraform-20260226101412756700000003]
module.github_runner.module.runners.aws_lambda_permission.ssm_housekeeper: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.github_runner.module.runners.aws_cloudwatch_event_target.scale_down: Refreshing state... [id=reinhardt-ci-scale-down-rule-terraform-20260226101420999500000004]
module.github_runner.module.runners.aws_lambda_permission.scale_down: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.github_runner.module.runners.aws_cloudwatch_log_group.scale_down: Refreshing state... [id=/aws/lambda/reinhardt-ci-scale-down]
module.github_runner.module.runners.module.job_retry[0].aws_sqs_queue.job_retry_check_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-job-retry]
module.github_runner.module.runners.aws_iam_role_policy.scale_up: Refreshing state... [id=reinhardt-ci-scale-up-lambda-72725e70:scale-up-policy]
module.github_runner.module.runner_binaries[0].aws_s3_bucket_ownership_controls.this: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.runner_binaries[0].aws_lambda_function.syncer: Refreshing state... [id=reinhardt-ci-syncer]
module.github_runner.module.runner_binaries[0].aws_s3_bucket_public_access_block.action_dist: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.runners["release"].module.job_retry[0].module.job_retry.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.github_runner.module.runners["release"].module.job_retry[0].module.job_retry.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.github_runner.module.webhook.module.eventbridge[0].null_resource.github_app_parameters: Refreshing state... [id=2628779838488801621]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role.webhook_lambda: Refreshing state... [id=reinhardt-ci-eventbridge-webhook-lambda-8cf23647]
module.github_runner.module.runner_binaries[0].aws_s3_bucket_server_side_encryption_configuration.action_dist[0]: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.runners.aws_iam_role_policy.ssm_housekeeper_logging: Refreshing state... [id=reinhardt-ci-ssm-hk-lambda-ee965098:logging-policy]
module.github_runner.module.runners["ci"].module.job_retry[0].module.job_retry.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.github_runner.module.runners["ci"].module.job_retry[0].module.job_retry.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.github_runner.module.runner_binaries[0].aws_iam_role_policy.syncer: Refreshing state... [id=reinhardt-ci-syncer-lambda-05106e03:s3-policy]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role.dispatcher_lambda: Refreshing state... [id=reinhardt-ci-dispatcher-lambda-1cc51177]
module.github_runner.module.runner_binaries[0].aws_s3_bucket_versioning.action_dist: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.runner_binaries[0].aws_s3_bucket_lifecycle_configuration.bucket_config: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.webhook.module.eventbridge[0].aws_cloudwatch_event_bus.main: Refreshing state... [id=reinhardt-ci-runners]
module.github_runner.module.runners.aws_iam_role_policy.scale_down_logging: Refreshing state... [id=reinhardt-ci-scale-down-lambda-56d130b4:logging-policy]
module.github_runner.module.runners.module.job_retry[0].aws_sqs_queue_policy.job_retry_check_queue_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-job-retry]
module.github_runner.module.runners.module.job_retry[0].module.job_retry.aws_iam_role.main: Refreshing state... [id=reinhardt-ci-job-retry-915fd34f]
module.github_runner.module.runner_binaries[0].aws_s3_bucket_policy.action_dist_bucket_policy: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.runners.aws_iam_role_policy.job_retry_sqs_publish[0]: Refreshing state... [id=reinhardt-ci-scale-up-lambda-72725e70:publish-retry-check-sqs-policy]
module.github_runner.module.webhook.module.eventbridge[0].aws_cloudwatch_event_archive.main: Refreshing state... [id=reinhardt-ci-runners-archive]
module.github_runner.module.webhook.module.eventbridge[0].aws_cloudwatch_event_rule.workflow_job: Refreshing state... [id=reinhardt-ci-runners/reinhardt-ci-workflow_job]
module.github_runner.module.runner_binaries[0].aws_cloudwatch_event_target.syncer: Refreshing state... [id=reinhardt-ci-syncer-rule-terraform-20260226101428309900000005]
module.github_runner.module.runner_binaries[0].aws_lambda_permission.syncer: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.github_runner.module.runner_binaries[0].aws_lambda_permission.on_deploy: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.github_runner.module.runner_binaries[0].aws_cloudwatch_log_group.syncer: Refreshing state... [id=/aws/lambda/reinhardt-ci-syncer]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.webhook_eventbridge: Refreshing state... [id=reinhardt-ci-eventbridge-webhook-lambda-8cf23647:publish-eventbridge-policy]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.webhook_kms: Refreshing state... [id=reinhardt-ci-eventbridge-webhook-lambda-8cf23647:kms-policy]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.webhook_ssm: Refreshing state... [id=reinhardt-ci-eventbridge-webhook-lambda-8cf23647:publish-ssm-policy]
module.github_runner.module.runner_binaries[0].aws_s3_bucket_notification.on_deploy: Refreshing state... [id=reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7]
module.github_runner.module.webhook.module.eventbridge[0].aws_lambda_function.webhook: Refreshing state... [id=reinhardt-ci-webhook]
module.github_runner.module.runner_binaries[0].aws_iam_role_policy.lambda_logging: Refreshing state... [id=reinhardt-ci-syncer-lambda-05106e03:logging-policys]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.dispatcher_ssm: Refreshing state... [id=reinhardt-ci-dispatcher-lambda-1cc51177:publish-ssm-policy]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.dispatcher_kms: Refreshing state... [id=reinhardt-ci-dispatcher-lambda-1cc51177:kms-policy]
module.github_runner.module.webhook.module.eventbridge[0].aws_lambda_function.dispatcher: Refreshing state... [id=reinhardt-ci-dispatch-to-runner]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.dispatcher_sqs: Refreshing state... [id=reinhardt-ci-dispatcher-lambda-1cc51177:publish-sqs-policy]
module.github_runner.module.runners.module.job_retry[0].module.job_retry.aws_lambda_function.main: Refreshing state... [id=reinhardt-ci-job-retry]
module.github_runner.module.runner_binaries[0].aws_s3_object.trigger: Refreshing state... [id=triggers/reinhardt-ci-syncer-trigger.json]
module.github_runner.module.webhook.module.eventbridge[0].aws_lambda_permission.allow_cloudwatch_to_call_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.github_runner.module.webhook.module.eventbridge[0].aws_cloudwatch_log_group.dispatcher: Refreshing state... [id=/aws/lambda/reinhardt-ci-dispatch-to-runner]
module.github_runner.module.webhook.module.eventbridge[0].aws_cloudwatch_event_target.dispatcher: Refreshing state... [id=reinhardt-ci-runners-reinhardt-ci-workflow_job-terraform-20260226101442655400000007]
module.github_runner.module.webhook.module.eventbridge[0].aws_lambda_permission.webhook: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.github_runner.module.webhook.module.eventbridge[0].aws_cloudwatch_log_group.webhook: Refreshing state... [id=/aws/lambda/reinhardt-ci-webhook]
module.github_runner.module.runners.module.job_retry[0].module.job_retry.aws_cloudwatch_log_group.main: Refreshing state... [id=/aws/lambda/reinhardt-ci-job-retry]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.dispatcher_logging: Refreshing state... [id=reinhardt-ci-dispatcher-lambda-1cc51177:logging-policy]
module.github_runner.module.webhook.module.eventbridge[0].aws_iam_role_policy.webhook_logging: Refreshing state... [id=reinhardt-ci-eventbridge-webhook-lambda-8cf23647:logging-policy]
module.github_runner.module.webhook.aws_apigatewayv2_integration.webhook: Refreshing state... [id=2y6917e]
module.github_runner.module.runners.module.job_retry[0].module.job_retry.aws_iam_role_policy.lambda_logging: Refreshing state... [id=reinhardt-ci-job-retry-915fd34f:logging-policy]
module.github_runner.module.runners.module.job_retry[0].aws_iam_role_policy.job_retry: Refreshing state... [id=reinhardt-ci-job-retry-915fd34f:job_retry-policy]
module.github_runner.module.runners.module.job_retry[0].aws_lambda_permission.job_retry: Refreshing state... [id=AllowExecutionFromSQS]
module.github_runner.module.runners.module.job_retry[0].aws_lambda_event_source_mapping.job_retry: Refreshing state... [id=1271bbb3-9526-4d02-8102-841ff77e587f]
module.github_runner.module.webhook.aws_apigatewayv2_route.webhook: Refreshing state... [id=eu0n6fi]
module.github_runner.module.runners.aws_iam_role_policy.dist_bucket[0]: Refreshing state... [id=reinhardt-ci-runner-9298d1bf:distribution-bucket]
module.github_runner.module.runners.aws_launch_template.runner: Refreshing state... [id=lt-0a54af5c93f0f00ae]
module.github_runner.module.runners.aws_lambda_function.scale_up: Refreshing state... [id=reinhardt-ci-scale-up]
module.github_runner.module.runners.aws_lambda_event_source_mapping.scale_up: Refreshing state... [id=3b5586a1-8577-4974-aa25-85864862cb06]
module.github_runner.module.runners.aws_lambda_permission.scale_runners_lambda: Refreshing state... [id=AllowExecutionFromSQS]
module.github_runner.module.runners.aws_cloudwatch_log_group.scale_up: Refreshing state... [id=/aws/lambda/reinhardt-ci-scale-up]
module.github_runner.module.runners.aws_iam_role_policy.scale_up_logging: Refreshing state... [id=reinhardt-ci-scale-up-lambda-72725e70:logging-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy.scale_up_ssm_get_parameter will be destroyed
  # (because aws_iam_role_policy.scale_up_ssm_get_parameter is not in configuration)
  - resource "aws_iam_role_policy" "scale_up_ssm_get_parameter" {
      - id          = "reinhardt-ci-scale-up-lambda-72725e70:ssm-get-parameter-ami-resolve" -> null
      - name        = "ssm-get-parameter-ami-resolve" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:us-east-1:819171434490:parameter/reinhardt-ci/runner-ami-id",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "reinhardt-ci-scale-up-lambda-72725e70" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.scale_up_ssm_get_parameter_ci will be created
  + resource "aws_iam_role_policy" "scale_up_ssm_get_parameter_ci" {
      + id          = (known after apply)
      + name        = "ssm-get-parameter-ami-resolve"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:819171434490:parameter/reinhardt-ci/runner-ami-id",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "reinhardt-ci-ci-scale-up-lambda-a944e9e9"
    }

  # aws_iam_role_policy.scale_up_ssm_get_parameter_release will be created
  + resource "aws_iam_role_policy" "scale_up_ssm_get_parameter_release" {
      + id          = (known after apply)
      + name        = "ssm-get-parameter-ami-resolve"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:819171434490:parameter/reinhardt-ci/runner-ami-id",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "reinhardt-ci-release-scale-up-lambda-e77f54ee"
    }

  # module.github_runner.aws_sqs_queue.queued_builds will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_sqs_queue" "queued_builds" {
      - arn                               = "arn:aws:sqs:us-east-1:819171434490:reinhardt-ci-queued-builds" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 30 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-queued-builds" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 86400 -> null
      - name                              = "reinhardt-ci-queued-builds" -> null
      - policy                            = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "DenyUnsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - receive_wait_time_seconds         = 0 -> null
      - sqs_managed_sse_enabled           = true -> null
      - tags                              = {} -> null
      - tags_all                          = {
          - "Component" = "github-runners"
          - "ManagedBy" = "terraform"
          - "Project"   = "reinhardt"
        } -> null
      - url                               = "https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-queued-builds" -> null
      - visibility_timeout_seconds        = 30 -> null
        # (6 unchanged attributes hidden)
    }

  # module.github_runner.aws_sqs_queue.queued_builds["ci"] will be created
  + resource "aws_sqs_queue" "queued_builds" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 30
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "reinhardt-ci-ci-queued-builds"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Component" = "github-runners"
          + "ManagedBy" = "terraform"
          + "Project"   = "reinhardt"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.github_runner.aws_sqs_queue.queued_builds["release"] will be created
  + resource "aws_sqs_queue" "queued_builds" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 30
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "reinhardt-ci-release-queued-builds"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Component" = "github-runners"
          + "ManagedBy" = "terraform"
          + "Project"   = "reinhardt"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.github_runner.aws_sqs_queue_policy.build_queue_policy will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_sqs_queue_policy" "build_queue_policy" {
      - id        = "https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-queued-builds" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "DenyUnsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - queue_url = "https://sqs.us-east-1.amazonaws.com/819171434490/reinhardt-ci-queued-builds" -> null
    }

  # module.github_runner.aws_sqs_queue_policy.build_queue_policy["ci"] will be created
  + resource "aws_sqs_queue_policy" "build_queue_policy" {
      + id        = (known after apply)
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "DenyUnsecureTransport"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + queue_url = (known after apply)
    }

  # module.github_runner.aws_sqs_queue_policy.build_queue_policy["release"] will be created
  + resource "aws_sqs_queue_policy" "build_queue_policy" {
      + id        = (known after apply)
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "DenyUnsecureTransport"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + queue_url = (known after apply)
    }

  # module.github_runner.module.runner_binaries[0].aws_cloudwatch_event_rule.syncer will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_cloudwatch_event_rule" "syncer" {
      - arn                 = "arn:aws:events:us-east-1:819171434490:rule/reinhardt-ci-syncer-rule" -> null
      - event_bus_name      = "default" -> null
      - force_destroy       = false -> null
      - id                  = "reinhardt-ci-syncer-rule" -> null
      - is_enabled          = true -> null
      - name                = "reinhardt-ci-syncer-rule" -> null
      - schedule_expression = "cron(27 * * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {
          - "ghr:environment" = "reinhardt-ci"
        } -> null
      - tags_all            = {
          - "Component"       = "github-runners"
          - "ManagedBy"       = "terraform"
          - "Project"         = "reinhardt"
          - "ghr:environment" = "reinhardt-ci"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.github_runner.module.runner_binaries[0].aws_cloudwatch_event_target.syncer will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_cloudwatch_event_target" "syncer" {
      - arn            = "arn:aws:lambda:us-east-1:819171434490:function:reinhardt-ci-syncer" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "reinhardt-ci-syncer-rule-terraform-20260226101428309900000005" -> null
      - rule           = "reinhardt-ci-syncer-rule" -> null
      - target_id      = "terraform-20260226101428309900000005" -> null
        # (3 unchanged attributes hidden)
    }

  # module.github_runner.module.runner_binaries[0].aws_cloudwatch_log_group.syncer will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_cloudwatch_log_group" "syncer" {
      - arn               = "arn:aws:logs:us-east-1:819171434490:log-group:/aws/lambda/reinhardt-ci-syncer" -> null
      - id                = "/aws/lambda/reinhardt-ci-syncer" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/reinhardt-ci-syncer" -> null
      - retention_in_days = 180 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "ghr:environment" = "reinhardt-ci"
        } -> null
      - tags_all          = {
          - "Component"       = "github-runners"
          - "ManagedBy"       = "terraform"
          - "Project"         = "reinhardt"
          - "ghr:environment" = "reinhardt-ci"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.github_runner.module.runner_binaries[0].aws_iam_role.syncer_lambda will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_iam_role" "syncer_lambda" {
      - arn                   = "arn:aws:iam::819171434490:role/reinhardt-ci/reinhardt-ci-syncer-lambda-05106e03" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2026-02-26T10:13:55Z" -> null
      - force_detach_policies = false -> null
      - id                    = "reinhardt-ci-syncer-lambda-05106e03" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "reinhardt-ci-syncer-lambda-05106e03" -> null
      - path                  = "/reinhardt-ci/" -> null
      - tags                  = {
          - "ghr:environment" = "reinhardt-ci"
        } -> null
      - tags_all              = {
          - "Component"       = "github-runners"
          - "ManagedBy"       = "terraform"
          - "Project"         = "reinhardt"
          - "ghr:environment" = "reinhardt-ci"
        } -> null
      - unique_id             = "AROA35OTMD75GP7KNRTHP" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "logging-policys" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:us-east-1:819171434490:log-group:/aws/lambda/reinhardt-ci-syncer*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "s3-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:GetObjectTagging",
                              - "s3:GetObjectVersionTagging",
                              - "s3:PutObject",
                              - "s3:PutObjectTagging",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7/actions-runner-linux.tar.gz",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_iam_role_policy.lambda_logging will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_iam_role_policy" "lambda_logging" {
      - id          = "reinhardt-ci-syncer-lambda-05106e03:logging-policys" -> null
      - name        = "logging-policys" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:819171434490:log-group:/aws/lambda/reinhardt-ci-syncer*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "reinhardt-ci-syncer-lambda-05106e03" -> null
        # (1 unchanged attribute hidden)
    }

  # module.github_runner.module.runner_binaries[0].aws_iam_role_policy.syncer will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_iam_role_policy" "syncer" {
      - id          = "reinhardt-ci-syncer-lambda-05106e03:s3-policy" -> null
      - name        = "s3-policy" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObjectTagging",
                          - "s3:GetObjectVersionTagging",
                          - "s3:PutObject",
                          - "s3:PutObjectTagging",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7/actions-runner-linux.tar.gz",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "reinhardt-ci-syncer-lambda-05106e03" -> null
        # (1 unchanged attribute hidden)
    }

  # module.github_runner.module.runner_binaries[0].aws_lambda_function.syncer will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_lambda_function" "syncer" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:819171434490:function:reinhardt-ci-syncer" -> null
      - code_sha256                    = "G3pN/RqVxxudCIPbqhZgps9nu96ludya2zoYSicNMos=" -> null
      - filename                       = "./lambdas/runner-binaries-syncer.zip" -> null
      - function_name                  = "reinhardt-ci-syncer" -> null
      - handler                        = "index.handler" -> null
      - id                             = "reinhardt-ci-syncer" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:819171434490:function:reinhardt-ci-syncer/invocations" -> null
      - last_modified                  = "2026-03-08T01:25:58.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 256 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:819171434490:function:reinhardt-ci-syncer:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:819171434490:function:reinhardt-ci-syncer:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::819171434490:role/reinhardt-ci/reinhardt-ci-syncer-lambda-05106e03" -> null
      - runtime                        = "nodejs22.x" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "G3pN/RqVxxudCIPbqhZgps9nu96ludya2zoYSicNMos=" -> null
      - source_code_size               = 489141 -> null
      - tags                           = {
          - "ghr:environment" = "reinhardt-ci"
        } -> null
      - tags_all                       = {
          - "Component"       = "github-runners"
          - "ManagedBy"       = "terraform"
          - "Project"         = "reinhardt"
          - "ghr:environment" = "reinhardt-ci"
        } -> null
      - timeout                        = 300 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "ENVIRONMENT"                              = "reinhardt-ci"
              - "GITHUB_RUNNER_ARCHITECTURE"               = "arm64"
              - "GITHUB_RUNNER_OS"                         = "linux"
              - "LOG_LEVEL"                                = "info"
              - "POWERTOOLS_LOGGER_LOG_EVENT"              = "false"
              - "POWERTOOLS_TRACER_CAPTURE_ERROR"          = "false"
              - "POWERTOOLS_TRACER_CAPTURE_HTTPS_REQUESTS" = "false"
              - "POWERTOOLS_TRACE_ENABLED"                 = "false"
              - "S3_BUCKET_NAME"                           = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7"
              - "S3_OBJECT_KEY"                            = "actions-runner-linux.tar.gz"
              - "S3_SSE_ALGORITHM"                         = "AES256"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/reinhardt-ci-syncer" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_lambda_permission.on_deploy will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_lambda_permission" "on_deploy" {
      - action                 = "lambda:InvokeFunction" -> null
      - function_name          = "arn:aws:lambda:us-east-1:819171434490:function:reinhardt-ci-syncer" -> null
      - id                     = "AllowExecutionFromS3Bucket" -> null
      - principal              = "s3.amazonaws.com" -> null
      - source_account         = "819171434490" -> null
      - source_arn             = "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - statement_id           = "AllowExecutionFromS3Bucket" -> null
        # (5 unchanged attributes hidden)
    }

  # module.github_runner.module.runner_binaries[0].aws_lambda_permission.syncer will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_lambda_permission" "syncer" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "reinhardt-ci-syncer" -> null
      - id                  = "AllowExecutionFromCloudWatch" -> null
      - principal           = "events.amazonaws.com" -> null
      - source_arn          = "arn:aws:events:us-east-1:819171434490:rule/reinhardt-ci-syncer-rule" -> null
      - statement_id        = "AllowExecutionFromCloudWatch" -> null
        # (2 unchanged attributes hidden)
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket.action_dist will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket" "action_dist" {
      - arn                         = "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - bucket                      = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - bucket_domain_name          = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7/*",
                          - "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7",
                        ]
                      - Sid       = "ForceSSLOnlyAccess"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringNotEquals = {
                              - "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7/*"
                      - Sid       = "ForceSSE"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "ghr:environment" = "reinhardt-ci"
        } -> null
      - tags_all                    = {
          - "Component"       = "github-runners"
          - "ManagedBy"       = "terraform"
          - "Project"         = "reinhardt"
          - "ghr:environment" = "reinhardt-ci"
        } -> null
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "9c05a2dccb728dfe0e66351703e88db095b4a7ecc394909232470df10e59d719" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 7 -> null
          - enabled                                = true -> null
          - id                                     = "lifecycle_config" -> null
          - tags                                   = {} -> null
            # (1 unchanged attribute hidden)

          - transition {
              - days          = 35 -> null
              - storage_class = "INTELLIGENT_TIERING" -> null
                # (1 unchanged attribute hidden)
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket_lifecycle_configuration.bucket_config will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket_lifecycle_configuration" "bucket_config" {
      - bucket                                 = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - id                                     = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - transition_default_minimum_object_size = "all_storage_classes_128K" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - id     = "lifecycle_config" -> null
          - status = "Enabled" -> null
            # (1 unchanged attribute hidden)

          - abort_incomplete_multipart_upload {
              - days_after_initiation = 7 -> null
            }

          - filter {
                # (1 unchanged attribute hidden)
            }

          - transition {
              - days          = 35 -> null
              - storage_class = "INTELLIGENT_TIERING" -> null
            }
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket_notification.on_deploy will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket_notification" "on_deploy" {
      - bucket      = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - eventbridge = false -> null
      - id          = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - filter_prefix       = "triggers/" -> null
          - filter_suffix       = ".json" -> null
          - id                  = "tf-s3-lambda-20260226101428954400000006" -> null
          - lambda_function_arn = "arn:aws:lambda:us-east-1:819171434490:function:reinhardt-ci-syncer" -> null
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket_ownership_controls.this will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "this" {
      - bucket = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - id     = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null

      - rule {
          - object_ownership = "BucketOwnerEnforced" -> null
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket_policy.action_dist_bucket_policy will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket_policy" "action_dist_bucket_policy" {
      - bucket = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - id     = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7/*",
                          - "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7",
                        ]
                      - Sid       = "ForceSSLOnlyAccess"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringNotEquals = {
                              - "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7/*"
                      - Sid       = "ForceSSE"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket_public_access_block.action_dist will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "action_dist" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - id                      = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket_server_side_encryption_configuration.action_dist[0] will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "action_dist" {
      - bucket                = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - id                    = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_bucket_versioning.action_dist will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_bucket_versioning" "action_dist" {
      - bucket                = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - id                    = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Disabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.github_runner.module.runner_binaries[0].aws_s3_object.trigger will be destroyed
  # (because module.github_runner.module.runner_binaries[0] is not in configuration)
  - resource "aws_s3_object" "trigger" {
      - arn                           = "arn:aws:s3:::reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7/triggers/reinhardt-ci-syncer-trigger.json" -> null
      - bucket                        = "reinhardt-ci-dist-bkxacftef2lfudgwh3khloh7" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "20355efabaae9ed4d51fbc5a68eb4ce3" -> null
      - force_destroy                 = false -> null
      - id                            = "triggers/reinhardt-ci-syncer-trigger.json" -> null
      - key                           = "triggers/reinhardt-ci-syncer-trigger.json" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = ".terraform/modules/github_runner/modules/runner-binaries-syncer/trigger.json" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Component" = "github-runners"
          - "ManagedBy" = "terraform"
          - "Project"   = "reinhardt"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.github_runner.module.runner_binaries["linux_arm64"].data.aws_iam_policy_document.action_dist_bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "action_dist_bucket_policy" {
      + id            = (known after apply)
      + json 

... (truncated)
```

</details>